In [65]:
import pandas as pd
from sqlalchemy import create_engine, inspect

In [66]:
#store csv file into dataframe and view header of file
csv_file1 = "Data/ASGARD - Global-Artificial-Intelligence-Database-2018.csv"
aidb_data_df = pd.read_csv(csv_file1)
aidb_data_df.head()

,Country,State,City,Name,Category - Final,Description,Website
0,United States,�New York,New York,*gram Labs,Core AI,"GramLabs is a start up, leveraging deep learni...",http://gramlabs.ai/
1,Germany,NaN,Berlin,12k Research,Business Intelligence,NaN,https://12k.co
2,Israel,�HaMerkaz,Savyon,12mass,Communication,12Mass (formerly itweetlive) makes it possible...,http://12mass.com
3,China,NaN,Beijing,12SIGMA,Healthcare,12SIGMA is a biotechnology company that integr...,http://www.12sigma.cn
4,United States,�Maryland,Germantown,133T.,Human Resources,"133T, (LEET), provides an automated, streamlin...",http://www.133t.com

In [113]:
len(aidb_data_df)

3466

In [114]:
##  Rename the column headers
aidb_data_df = aidb_data_df.rename(columns={"Category - Final": "Category"})
idb_data_df = aidb_data_df.rename(columns={"Name": "Company_Name"})
# Selecting the desired Columns
Caidb_data_df = aidb_data_df[["Country", "City", "Name", "Category", "Website"]]
#Droping the NaN values in coutnry column
Caidb_data_df = Caidb_data_df.dropna(axis = 0)
Caidb_data_df.set_index("Country", inplace=True)
#Caidb_data_df.head()

In [116]:
len(Caidb_data_df)

3272

In [117]:
# Cleaning the df to remove * . 
Caidb_data_df.Name = Caidb_data_df.Name.str.replace('*', '')
Caidb_data_df.Name = Caidb_data_df.Name.str.replace('.', '')
Caidb_data_df.head()

<ipython-input-117-0b7ce90e2415>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  Caidb_data_df.Name = Caidb_data_df.Name.str.replace('*', '')
<ipython-input-117-0b7ce90e2415>:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  Caidb_data_df.Name = Caidb_data_df.Name.str.replace('.', '')

,City,Name,Category,Website
Country,,,,
United States,New York,gram Labs,Core AI,http://gramlabs.ai/
Germany,Berlin,12k Research,Business Intelligence,https://12k.co
Israel,Savyon,12mass,Communication,http://12mass.com
China,Beijing,12SIGMA,Healthcare,http://www.12sigma.cn
United States,Germantown,133T,Human Resources,http://www.133t.com

In [118]:
Caidb_data_df.dtypes

City        object
Name        object
Category    object
Website     object
dtype: object

In [119]:
#store csv file into dataframe and view header of file
csv_file2 = "Data/Tech_Companies_Deals.csv"
tcd_data_df = pd.read_csv(csv_file2)
tcd_data_df.head()

,Country,Company_Count,Deal_Count,Capital_Invested,Capital_Invested_M,Revenue,Revenue_Max,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,United States,"71,150","181,524.00","3,832,098.10",1.48,12.22,"339,270.00",NaN,NaN,NaN
1,United Kingdom,"12,243","25,896.00","416,953.61",0.85,5.39,"9,591.12",NaN,NaN,NaN
2,Canada,"6,498","14,939","104,214.39",0.79,2.53,"6,245.08",NaN,NaN,NaN
3,Afghanistan,2,3,-,-,-,-,NaN,NaN,NaN
4,Albania,2,3,-,-,-,-,NaN,NaN,NaN

In [120]:

# Selecting the desired Columns
Ctcd_data_df = tcd_data_df[["Country", "Company_Count", "Deal_Count", "Capital_Invested", "Revenue_Max"]]
##  Rename the column headers
Ctcd_data_df = Ctcd_data_df.rename(columns={"Revenue_Max": "Revenue"})
#Droping the NaN values in coutnry column
Ctcd_data_df = Ctcd_data_df.dropna(subset=['Country'])
Ctcd_data_df.set_index("Country", inplace=True)
#Ctcd_data_df.head()

In [121]:
#Cleaning the data by removing , -
Ctcd_data_df.Company_Count = Ctcd_data_df.Company_Count.str.replace(',', '')
Ctcd_data_df.Deal_Count = Ctcd_data_df.Deal_Count.str.replace(',', '')
Ctcd_data_df.Capital_Invested = Ctcd_data_df.Capital_Invested.str.replace(',', '')
Ctcd_data_df.Capital_Invested = Ctcd_data_df.Capital_Invested.str.replace('-', '0')
Ctcd_data_df.Revenue = Ctcd_data_df.Revenue.str.replace(',', '')
Ctcd_data_df.Revenue = Ctcd_data_df.Revenue.str.replace('-', '0')

In [122]:
#Ctcd_data_df.head()

In [123]:
#Converting data types into integers
Ctcd_data_df["Company_Count"] = Ctcd_data_df.loc[:, ["Company_Count"]].astype(int)
Ctcd_data_df["Deal_Count"] = Ctcd_data_df.loc[:, ["Deal_Count"]].astype(float)
Ctcd_data_df["Deal_Count"] = Ctcd_data_df.loc[:, ["Deal_Count"]].astype(int)
Ctcd_data_df["Capital_Invested"] = Ctcd_data_df.loc[:, ["Capital_Invested"]].astype(float)
Ctcd_data_df["Capital_Invested"] = Ctcd_data_df.loc[:, ["Capital_Invested"]].astype(int)
Ctcd_data_df["Revenue"] = Ctcd_data_df.loc[:, ["Revenue"]].astype(float)
Ctcd_data_df["Revenue"] = Ctcd_data_df.loc[:, ["Revenue"]].astype(int)
Ctcd_data_df.head()

                Company_Count  Deal_Count  Capital_Invested  Revenue
Country
United States           71150      181524           3832098   339270
United Kingdom          12243       25896            416953     9591
Canada                   6498       14939            104214     6245
Afghanistan                 2           3                 0        0
Albania                     2           3                 0        0

In [124]:
Ctcd_data_df.dtypes

Company_Count       int64
Deal_Count          int64
Capital_Invested    int64
Revenue             int64
dtype: object

In [125]:
# No of Company wise list country list
Company_tcd = Ctcd_data_df.sort_values(["Company_Count"], ascending = False)
#Company_tcd.head()

In [126]:
# No of Deals  wise list country list
Deal_tcd = Ctcd_data_df.sort_values(["Deal_Count"], ascending = False)
#Deal_tcd.head()

In [127]:
# Capital Invested  wise list country list
Cap_tcd = Ctcd_data_df.sort_values(["Capital_Invested"], ascending = False)
#Cap_tcd.head()

In [128]:
# Revenue  wise list country list
Rev_tcd = Ctcd_data_df.sort_values(["Revenue"], ascending = False)
#Rev_tcd.head()

In [129]:
#store csv file into dataframe and view header of file
csv_file3 = "Data/AI Companies_Deals.csv"
aicd_data_df = pd.read_csv(csv_file3)
aicd_data_df.head()

,Countries,Company Count,Deal Count,Capital Invested,Capital Invested Median,Revenue Median,Revenue Max,Pre-money Valuation Median,% Acquired Median,Post Valuation Median
0,United States,"2,812","7,658","81,316.15",1.37,6.65,"8,756.53",7.8,23.80%,11.31
1,United Kingdom,478,"1,179","2,946.92",0.5,1.14,435.01,1.64,19.00%,2.2
2,Canada,282,870,"1,203.96",0.54,0.89,93.36,1.79,25.30%,1.97
3,Argentina,5,14,4.78,0.03,-,-,0.75,-,-
4,Australia,65,139,230.61,0.16,11.47,96.6,0.55,8.00%,0.59

In [130]:
# Selecting the desired Columns
Caicd_data_df = aicd_data_df[["Countries", "Company Count", "Deal Count", "Capital Invested", "Revenue Max"]]
#Ctcd_data_df = tcd_data_df[["Country", "Company_Count", "Deal_Count", "Capital_Invested", "Revenue_Max"]]
##  Rename the column headers
Caicd_data_df = Caicd_data_df.rename(columns={"Revenue Max": "Revenue", "Countries":"Country", "Company Count":"Company_Count","Deal Count":"Deal_Count","Revenue Max":"Revenue","Capital Invested":"Capital_Invested"})

#Droping the NaN values in coutnry column
Caicd_data_df = Caicd_data_df.dropna(subset=['Country'])
Caicd_data_df.set_index("Country", inplace=True)
Caicd_data_df.head()

               Company_Count Deal_Count Capital_Invested   Revenue
Country
United States          2,812      7,658        81,316.15  8,756.53
United Kingdom           478      1,179         2,946.92    435.01
Canada                   282        870         1,203.96     93.36
Argentina                  5         14             4.78         -
Australia                 65        139           230.61      96.6

In [131]:
#Cleaning the data by removing , -
Caicd_data_df.Company_Count = Caicd_data_df.Company_Count.str.replace(',', '')
Caicd_data_df.Deal_Count = Caicd_data_df.Deal_Count.str.replace(',', '')
Caicd_data_df.Capital_Invested = Caicd_data_df.Capital_Invested.str.replace(',', '')
Caicd_data_df.Capital_Invested = Caicd_data_df.Capital_Invested.str.replace('-', '0')
Caicd_data_df.Revenue = Caicd_data_df.Revenue.str.replace(',', '')
Caicd_data_df.Revenue = Caicd_data_df.Revenue.str.replace('-', '0')
#Caicd_data_df.head()

In [132]:
#Converting data types into integers
Caicd_data_df["Company_Count"] = Caicd_data_df.loc[:, ["Company_Count"]].astype(int)
Caicd_data_df["Deal_Count"] = Caicd_data_df.loc[:, ["Deal_Count"]].astype(float)
Caicd_data_df["Deal_Count"] = Caicd_data_df.loc[:, ["Deal_Count"]].astype(int)
Caicd_data_df["Capital_Invested"] = Caicd_data_df.loc[:, ["Capital_Invested"]].astype(float)
Caicd_data_df["Capital_Invested"] = Caicd_data_df.loc[:, ["Capital_Invested"]].astype(int)
Caicd_data_df["Revenue"] = Caicd_data_df.loc[:, ["Revenue"]].astype(float)
Caicd_data_df["Revenue"] = Caicd_data_df.loc[:, ["Revenue"]].astype(int)
Caicd_data_df.head()

                Company_Count  Deal_Count  Capital_Invested  Revenue
Country
United States            2812        7658             81316     8756
United Kingdom            478        1179              2946      435
Canada                    282         870              1203       93
Argentina                   5          14                 4        0
Australia                  65         139               230       96

In [133]:
# No of Company wise list country list
Company_aicd = Caicd_data_df.sort_values(["Company_Count"], ascending = False)
Company_aicd.head()

                Company_Count  Deal_Count  Capital_Invested  Revenue
Country
United States            2812        7658             81316     8756
United Kingdom            478        1179              2946      435
Canada                    282         870              1203       93
India                     255         615              4596    14359
China                     206         465             14896      278

In [134]:
# No of Deals  wise list country list
Deal_aicd = Caicd_data_df.sort_values(["Deal_Count"], ascending = False)
Deal_aicd.head()

                Company_Count  Deal_Count  Capital_Invested  Revenue
Country
United States            2812        7658             81316     8756
United Kingdom            478        1179              2946      435
Canada                    282         870              1203       93
India                     255         615              4596    14359
Israel                    202         507             14166      306

In [135]:
# Capital Invested  wise list country list
Cap_aicd = Caicd_data_df.sort_values(["Capital_Invested"], ascending = False)
Cap_aicd.head()

                Company_Count  Deal_Count  Capital_Invested  Revenue
Country
United States            2812        7658             81316     8756
China                     206         465             14896      278
Israel                    202         507             14166      306
India                     255         615              4596    14359
United Kingdom            478        1179              2946      435

In [136]:
# Revenue  wise list country list
Rev_aicd = Caicd_data_df.sort_values(["Revenue"], ascending = False)
Rev_aicd.head()

               Company_Count  Deal_Count  Capital_Invested  Revenue
Country
India                    255         615              4596    14359
Germany                  169         393              1716    12754
United States           2812        7658             81316     8756
Austria                   25          51                73     6304
Bermuda                    2          17              2266     2032

In [137]:
Caicd_data_df.dtypes

Company_Count       int64
Deal_Count          int64
Capital_Invested    int64
Revenue             int64
dtype: object

In [138]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /Users/admin/opt/anaconda3/lib/python3.8/site-packages (2.8.6)
Note: you may need to restart the kernel to use updated packages.

In [139]:
#  create database connection
connection_string = "postgres:nopass97@localhost:5432/Project"
engine = create_engine(f'postgresql://{connection_string}')

In [140]:
Caidb_data_df.to_sql(name='AIDB', con=engine, if_exists='replace', index=True)

In [141]:
Ctcd_data_df.to_sql(name='Tech_Companies_Deals', con=engine, if_exists='replace', index=True)

In [142]:
Caicd_data_df.to_sql(name='AI_Companies_Deals', con=engine, if_exists='replace', index=True)

In [143]:
Company_aicd.to_sql(name='AICD_Company', con=engine, if_exists='replace', index=True)

In [144]:
Deal_aicd.to_sql(name='AICD_Deals', con=engine, if_exists='replace', index=True)

In [145]:
Cap_aicd.to_sql(name='AICD_Capital', con=engine, if_exists='replace', index=True)

In [146]:
Rev_aicd.to_sql(name='AICD_Revenue', con=engine, if_exists='replace', index=True)

In [147]:
Company_tcd.to_sql(name='TCD_Company', con=engine, if_exists='replace', index=True)

In [148]:
Deal_tcd.to_sql(name='TCD_Deals', con=engine, if_exists='replace', index=True)

In [149]:
Cap_tcd.to_sql(name='TCD_Capital', con=engine, if_exists='replace', index=True)

In [150]:
Rev_tcd.to_sql(name='TCD_Revenue', con=engine, if_exists='replace', index=True)

In [151]:
# Create the inspector and connect it to the engine
inspector = inspect(engine)

In [152]:
# Confirm tables
engine.table_names()

<ipython-input-152-2d97e9123e98>:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['AIDB',
 'Tech_Companies_Deals',
 'AI_Companies_Deals',
 'AICD_Company',
 'AICD_Deals',
 'AICD_Capital',
 'AICD_Revenue',
 'TCD_Company',
 'TCD_Deals',
 'TCD_Capital',
 'TCD_Revenue']